# WebDlgEnableConsole

## Description
Enable web dialog console logging file. File located at: &amp;lt;user folder&amp;gt;/Plug-ins/ChromiumEF/WebBrowser_Console_Output.txt

```pascal
PROCEDURE WebDlgEnableConsole(enable : BOOLEAN);
```

```python

def vs.WebDlgEnableConsole(enable):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|enable|BOOLEAN||

## Version
Availability: from Vectorworks 2019
## Category
* Utility